In [9]:
import numpy as np
import pandas as pd
import os
import sqlalchemy
from sqlalchemy.ext.automap import automap_base
from sqlalchemy.orm import Session
from sqlalchemy import create_engine, func
from dotenv import load_dotenv
from flask import Flask, jsonify

In [16]:

load_dotenv()
password = os.getenv('Michaelflyer1')
user = os.getenv('postgres')

In [23]:
db_name = 'MLB_db'
engine = create_engine(f'postgresql://postgres:Michaelflyer1@localhost:5433/{db_name}')
con = engine

engine.table_names()

['parks',
 'teams',
 'salaries',
 'batting',
 'college',
 'hof',
 'managers',
 'college_details',
 'players']

In [27]:
parks = pd.read_sql_query("SELECT * FROM parks", con)
teams = pd.read_sql_query("SELECT * FROM teams", con)
salaries = pd.read_sql_query("SELECT * FROM salaries", con)
batting = pd.read_sql_query("SELECT * FROM batting", con)
college = pd.read_sql_query("SELECT * FROM college", con)
hof = pd.read_sql_query("SELECT * FROM hof", con)
managers = pd.read_sql_query("SELECT * FROM managers", con)
college_details = pd.read_sql_query("SELECT * FROM college_details", con)
players = pd.read_sql_query("SELECT * FROM players", con)

In [36]:
salhr_18 = pd.read_sql_query("SELECT salaries.playerid, salaries.salary, batting.hr, batting.teamid FROM salaries JOIN batting ON salaries.playerid=batting.playerid WHERE batting.yearid = '2018'", con)
salhr_18

       playerid    salary  hr teamid
0     abreujo02  11666667  22    CHA
1     abreujo02   8666000  22    CHA
2     abreujo02   7000000  22    CHA
3     adamsma01   1650000  18    WAS
4     adamsma01    534000  18    WAS
...         ...       ...  ..    ...
3282  zobribe01    415900   9    CHN
3283  zobribe01    395800   9    CHN
3284  zobribe01    383400   9    CHN
3285  zuninmi01    523500  20    SEA
3286  zuninmi01    504100  20    SEA

[3287 rows x 4 columns]

In [40]:
team_cap18 = pd.read_sql_query("SELECT teamid, total_2018 FROM team_spending", con)
team_wins = pd.read_sql_query("SELECT teamid, win_pct, total_2018 FROM team_spending", con)